In [4]:
#Conditional Probability P(A/B) - Probability of event A knowing that event B has already occured.
#Make a naive assumption that features such as male, class, age, abin, fare etc. are independent of each other.

import pandas as pd
df = pd.read_csv("titanic (1).csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [6]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [8]:
target=df.Survived
inputs=df.drop('Survived', axis='columns')

dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [9]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [10]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [11]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [29]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

len(X_train)

712

In [19]:
len(X_test)

179

In [20]:
len(inputs)

891

In [30]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

model.fit(X_train, y_train)

GaussianNB()

In [31]:
model.score(X_test,y_test)

0.7877094972067039

In [27]:
X_test[:10]

     Pclass        Age      Fare  female  male
557       1  29.699118  227.5250       0     1
100       3  28.000000    7.8958       1     0
643       3  29.699118   56.4958       0     1
111       3  14.500000   14.4542       1     0
684       2  60.000000   39.0000       0     1
596       2  29.699118   33.0000       1     0
735       3  28.500000   16.1000       0     1
356       1  22.000000   55.0000       1     0
494       3  21.000000    8.0500       0     1
393       1  23.000000  113.2750       1     0

In [32]:
y_test[:10]

397    0
302    0
369    1
813    0
269    1
193    1
100    0
57     0
690    1
127    1
Name: Survived, dtype: int64

In [33]:
model.predict(X_test[:10])

array([0, 0, 1, 1, 1, 0, 1, 0, 0, 0], dtype=int64)

In [34]:
model.predict_proba(X_test[:10])

array([[9.80094236e-01, 1.99057639e-02],
       [9.87848319e-01, 1.21516814e-02],
       [2.81774127e-03, 9.97182259e-01],
       [4.14021620e-02, 9.58597838e-01],
       [1.94891621e-05, 9.99980511e-01],
       [9.55094318e-01, 4.49056817e-02],
       [8.12228315e-02, 9.18777168e-01],
       [9.90706190e-01, 9.29380980e-03],
       [8.64620777e-01, 1.35379223e-01],
       [9.89951934e-01, 1.00480664e-02]])